import React, { FunctionComponent } from 'react';

import { Text } from '@chakra-ui/react';

import Layout from '../../components/Layout';
import Article from '../../components/Article';

const contents = [
  '元念外您色室這發媽色辛天貓很兔雲游道几，固欠嗎也幼友過！學朱坐何帶抄村蝶背「五昔羽來乾節在視朋」好呀個科把姐固愛快斥珠向子兔。圓占黃：話坐訴畫肉子給屋玉，習男用紅把蝶幾問是河合要寫百和西午扒從旦泉。',
  '古浪而卜皮游老開辛童今水一魚斤戶玉實即。弓就文服丁品立冰；由年過几苦哥姐，請禾像京父和以時，牙請唱波你經媽給里新美斗爬者誰重耳北。過做忍親有戶追祖九跟苗扒，升珠什隻連清晚回松：頭竹買背片。',
  '足來開找馬，瓜汁筆青流馬前羊呢。追主隻從苦就女寺田旁雄請交鳥，童雄西活，去住葉己牙告步六叫抄往乍象二抱見？羽言成經蝸土吉高白姊住貓。假尺升到日呀門也，乙相到晚實時、吉還細姊犬每公連員。',
  '河者月，幼右乾向亭和貓，年春房「世語胡耳打」兄雄尾進叫固頁燈掃目葉乞里空呢鳥泉牠見士「光不」陽抓重哭見戶？月穴像心荷親花枝往？吃娘畫幸帽四住亭第東，山次洋息媽具記耳浪「聽送定」。',
  '定子西合都斥荷新央而院朱甲；消里風雞得你左各用什刃刃，棵示記它北什員：飯學王蝸耍現王物蝶拉瓜不吃；兄現就！日明八直王車片卜久里林事：雨節打孝十一這共犬以杯陽活竹，行連幼眼巾雪真公您今國。',
  '種半會筆夕帶寫動士回羽由候東欠菜百幸我但，害心得：牛光怎相什：園眼澡點什早每送走加：怎意牠斤司兌實羽哥，車嗎神年十！視學戶男肖，語安很；信什再弓把每中。',
  '連外足急葉氣八何根彩麻，畫借送日可虎幫助工海點拍跟圓牠後親西汗，喜穴上交食美姐，明瓜蝶乞乾每；戊候服亭給跟穿車但游歌問成掃九：支錯哥根家跟路能成活火經收冒父面世能教裝四止真。',
  '少候耍爪，友爪次大那；十鼻着他馬五內收世師占耍道星斗校羊菜。收做貓了，跑央幼棵斥衣貝同課日飽我羊邊飽自，種足現欠條卜造動戶訴坡。',
  '婆步收點視才兒直借亮米午星車晚對習身學，即止別起害對春坐哪語化女羽有反生苦許，草孝明荷蝴對加候羊六很棵想。各方好中十院飛遠包。蝸她圓己地呢魚。',
  '品位朱肉爸回車前乾牛綠鳥您弟重良打物重蝴、南跳村申都巾黑步？見娘春帶斗：斤科象很子蝴奶汁朋安何成肖公。',
  '香安爪巾吃松裝過晚「林工少今抱頁再」升新犬澡、可手穴爪，苦斤爸尾午買巾支升包科和戊皮她。圓喝山耍起完怕能說拉，流國穿屋，林多力。',
  '往愛胡連字只西苦房開開母的也在見。方消己念能巴三牙右犬扒，香去斗果止父，禾小雪假光玩手秋且放魚弓時毛葉足遠媽夏：辛急師幼抓進。從巾愛左貓；抱英司邊雨裏荷朱內流冰。',
  '小黑笑金消，開肖科水雄花兆「姊荷七外背穴尾土院兔」勿定平哭馬院幫？做浪麼采葉。'
];

const Example: FunctionComponent = () => (
  <Layout>
    <Article
      date="2022-12-31"
      title="士可升七掃幾占進免行方"
      tags={['JS', 'TS', 'React', 'Vue']}
      bannerSrc="https://picsum.photos/1000/200"
    >
      {contents.map((content, index) => (
        <Text
          // eslint-disable-next-line react/no-array-index-key
          key={index}
          fontSize="xl"
        >
          {content}
        </Text>
      ))}
    </Article>
  </Layout>
);
export default Example;
